In [1]:
import pandas as pd

In [8]:
dict1={
    "name":["harsh","rahul","gaurav"],
    "cgpa":[7.1,8.2,7.2],
    "nature":["happy","joking","silent"],
}

In [9]:
dict1

{'name': ['harsh', 'rahul', 'gaurav'],
 'cgpa': [7.1, 8.2, 7.2],
 'nature': ['happy', 'joking', 'silent']}

In [11]:
df=pd.DataFrame(dict1)

In [28]:
df.to_csv("class.csv",index=False)

In [164]:
df1=pd.read_csv('class.csv')

In [165]:
df1=df1.iloc[:,1:]

In [166]:
df1

     name  cgpa  nature
0   harsh   7.1   happy
1   rahul   8.2  joking
2  gaurav   7.2  silent

In [35]:
df1.head(2)

    name  cgpa  nature
0  harsh   7.1   happy
1  rahul   8.2  joking

In [36]:
df1.tail(1)

     name  cgpa  nature
2  gaurav   7.2  silent

In [43]:
df1.describe()

           cgpa
count  3.000000
mean   7.500000
std    0.608276
min    7.100000
25%    7.150000
50%    7.200000
75%    7.700000
max    8.200000

In [44]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   cgpa    3 non-null      float64
 2   nature  3 non-null      object
dtypes: float64(1), object(2)
memory usage: 200.0+ bytes

In [45]:
df1.shape

(3, 3)

In [46]:
df1.dtypes

name       object
cgpa      float64
nature     object
dtype: object

In [48]:
df1.columns=['pp','hd','dh']

In [49]:
df1

       pp   hd      dh
0   harsh  7.1   happy
1   rahul  8.2  joking
2  gaurav  7.2  silent

In [53]:
df1.columns=df.columns[1:]

In [54]:
df1

     name  cgpa  nature
0   harsh   7.1   happy
1   rahul   8.2  joking
2  gaurav   7.2  silent

In [167]:
df1['cgpa']=df1['cgpa'].astype('int64')

In [168]:
df1.iloc[:,1:]

   cgpa  nature
0     7   happy
1     8  joking
2     7  silent

In [61]:
df1.T

            0       1       2
name    harsh   rahul  gaurav
cgpa        7       8       7
nature  happy  joking  silent

In [62]:
df1

     name  cgpa  nature
0   harsh     7   happy
1   rahul     8  joking
2  gaurav     7  silent

In [113]:
df1.loc[1:,'cgpa':] #in .loc we have to specify row and column name

   cgpa  nature
1     8  joking
2     7  silent

In [75]:
df1.iloc[1:,1:] # in .iloc we don't have to specify column name

   cgpa  nature
1     8  joking
2     7  silent

In [77]:
np_ary=df1.values

In [78]:
np_ary

array([['harsh', 7, 'happy'],
       ['rahul', 8, 'joking'],
       ['gaurav', 7, 'silent']], dtype=object)

In [169]:
df1['branch']=['cse','cse',None]

In [170]:
df1

     name  cgpa  nature branch
0   harsh     7   happy    cse
1   rahul     8  joking    cse
2  gaurav     7  silent   None

In [157]:
df1.isnull().sum()

cgpa      0
nature    0
branch    1
dtype: int64

In [171]:
df1.loc[len(df1.index)] = ['dwarki', 9, 'friendly','cse']

In [172]:
df1.iloc[:,:]

     name  cgpa    nature branch
0   harsh     7     happy    cse
1   rahul     8    joking    cse
2  gaurav     7    silent   None
3  dwarki     9  friendly    cse

In [121]:
df1.sort_values('cgpa',ascending=False)

     name  cgpa    nature branch
3  dwarki     9  friendly    cse
1   rahul     8    joking    cse
0   harsh     7     happy    cse
2  gaurav     7    silent   None

In [123]:
df1['nature'].value_counts()

happy       1
joking      1
silent      1
friendly    1
Name: nature, dtype: int64

In [124]:
df1['cgpa'].value_counts()

7    2
8    1
9    1
Name: cgpa, dtype: int64

In [130]:
df1

     name  cgpa    nature branch
0   harsh     7     happy    cse
1   rahul     8    joking    cse
2  gaurav     7    silent   None
3  dwarki     9  friendly    cse

In [134]:
df1=df1.iloc[:,:-1]

In [173]:
df1.iloc[0,1]=8
df1.iloc[1,1]=7

In [174]:
df1

     name  cgpa    nature branch
0   harsh     8     happy    cse
1   rahul     7    joking    cse
2  gaurav     7    silent   None
3  dwarki     9  friendly    cse

In [175]:
df1['cgpa'].unique()

array([8, 7, 9], dtype=int64)

## Select those rows having cgpa greater then 8

In [176]:
df1[df1['cgpa']>=8]

     name  cgpa    nature branch
0   harsh     8     happy    cse
3  dwarki     9  friendly    cse

## Highest cgpa

In [178]:
df2=df1[df1['cgpa']==max(df1['cgpa'])]

In [179]:
df2

     name  cgpa    nature branch
3  dwarki     9  friendly    cse

In [188]:
df1.ndim

2

In [189]:
df3=df1

In [194]:
df3=df3.sort_values('cgpa',ascending=True)

In [195]:
df3

     name  cgpa    nature branch
1   rahul     7    joking    cse
2  gaurav     7    silent   None
0   harsh     8     happy    cse
3  dwarki     9  friendly    cse

In [201]:
df3.replace(['cse',None],['home','friends'])

     name  cgpa    nature   branch
1   rahul     7    joking     home
2  gaurav     7    silent  friends
0   harsh     8     happy     home
3  dwarki     9  friendly     home

In [202]:
df3

     name  cgpa    nature branch
1   rahul     7    joking    cse
2  gaurav     7    silent   None
0   harsh     8     happy    cse
3  dwarki     9  friendly    cse

In [208]:
df3=df3.dropna()

In [209]:
df3

     name  cgpa    nature branch
1   rahul     7    joking    cse
0   harsh     8     happy    cse
3  dwarki     9  friendly    cse

In [222]:
df4=df1

In [223]:
df4

     name  cgpa    nature branch
0   harsh     8     happy    cse
1   rahul     7    joking    cse
2  gaurav     7    silent   None
3  dwarki     9  friendly    cse

In [224]:
df4.isnull().sum()

name      0
cgpa      0
nature    0
branch    1
dtype: int64

In [225]:
df4=df4.fillna('mech')

In [226]:
df4

     name  cgpa    nature branch
0   harsh     8     happy    cse
1   rahul     7    joking    cse
2  gaurav     7    silent   mech
3  dwarki     9  friendly    cse

In [234]:
df4.groupby('branch')['cgpa'].mean()

branch
cse     8.0
mech    7.0
Name: cgpa, dtype: float64

# Joins

In [250]:
df5=pd.DataFrame({'branch':['cse','mech','IT'],"branch_avg_salary(in lpa)":[16,9,12]})

In [251]:
df5

  branch  branch_avg_salary(in lpa)
0    cse                         16
1   mech                          9
2     IT                         12

In [252]:
df4

     name  cgpa    nature branch
0   harsh     8     happy    cse
1   rahul     7    joking    cse
2  gaurav     7    silent   mech
3  dwarki     9  friendly    cse

In [253]:
pd.merge(df4,df5,on='branch')

     name  cgpa    nature branch  branch_avg_salary(in lpa)
0   harsh     8     happy    cse                         16
1   rahul     7    joking    cse                         16
2  dwarki     9  friendly    cse                         16
3  gaurav     7    silent   mech                          9

In [254]:
pd.merge(df4,df5,on='branch',how='left')

     name  cgpa    nature branch  branch_avg_salary(in lpa)
0   harsh     8     happy    cse                         16
1   rahul     7    joking    cse                         16
2  gaurav     7    silent   mech                          9
3  dwarki     9  friendly    cse                         16

In [255]:
pd.merge(df4,df5,on='branch',how='right')

     name  cgpa    nature branch  branch_avg_salary(in lpa)
0   harsh   8.0     happy    cse                         16
1   rahul   7.0    joking    cse                         16
2  dwarki   9.0  friendly    cse                         16
3  gaurav   7.0    silent   mech                          9
4     NaN   NaN       NaN     IT                         12

In [257]:
pd.merge(df4,df5,on='branch',how='outer') # return null values from either and both tables

     name  cgpa    nature branch  branch_avg_salary(in lpa)
0   harsh   8.0     happy    cse                         16
1   rahul   7.0    joking    cse                         16
2  dwarki   9.0  friendly    cse                         16
3  gaurav   7.0    silent   mech                          9
4     NaN   NaN       NaN     IT                         12

# Concatenation

In [264]:
df6=pd.DataFrame(
        {
            "name":["harshitha","nidhi","sumit"],
            "cgpa":[9,6,7],
            "nature":["happy","joking","friendly"],
            "branch":['cse','bsc_cse','electrical']
        }
)

In [265]:
df6

        name  cgpa    nature      branch
0  harshitha     9     happy         cse
1      nidhi     6    joking     bsc_cse
2      sumit     7  friendly  electrical

In [266]:
df4

     name  cgpa    nature branch
0   harsh     8     happy    cse
1   rahul     7    joking    cse
2  gaurav     7    silent   mech
3  dwarki     9  friendly    cse

In [268]:
df7=pd.concat([df4,df6],ignore_index=True)

In [269]:
df7

        name  cgpa    nature      branch
0      harsh     8     happy         cse
1      rahul     7    joking         cse
2     gaurav     7    silent        mech
3     dwarki     9  friendly         cse
4  harshitha     9     happy         cse
5      nidhi     6    joking     bsc_cse
6      sumit     7  friendly  electrical

# Pivot_Table

In [280]:
pd.pivot_table(df7,index=df7.branch,columns=df7.nature,aggfunc="sum")

               cgpa
nature     friendly happy joking silent
branch
bsc_cse         NaN   NaN    6.0    NaN
cse             9.0  17.0    7.0    NaN
electrical      7.0   NaN    NaN    NaN
mech            NaN   NaN    NaN    7.0

# Important difference in numpy std and pandas std

In [283]:
import numpy as np

In [281]:
df7

        name  cgpa    nature      branch
0      harsh     8     happy         cse
1      rahul     7    joking         cse
2     gaurav     7    silent        mech
3     dwarki     9  friendly         cse
4  harshitha     9     happy         cse
5      nidhi     6    joking     bsc_cse
6      sumit     7  friendly  electrical

In [282]:
df7['cgpa'].std()

1.1338934190276817

In [284]:
np.std(df7['cgpa'])

1.049781318335648

### There is difference in standard deviation because of difference in formula check below link

https://stackoverflow.com/questions/24984178/different-std-in-pandas-vs-numpy

In [299]:
np.std(df7['cgpa'],ddof=1)

1.1338934190276817

# Group by

In [291]:
df7

        name  cgpa    nature      branch
0      harsh     8     happy         cse
1      rahul     7    joking         cse
2     gaurav     7    silent        mech
3     dwarki     9  friendly         cse
4  harshitha     9     happy         cse
5      nidhi     6    joking     bsc_cse
6      sumit     7  friendly  electrical

In [294]:
df8=df7.groupby('branch')

In [298]:
df8.get_group('cse').sort_values('cgpa',ascending=True)

        name  cgpa    nature branch
1      rahul     7    joking    cse
0      harsh     8     happy    cse
3     dwarki     9  friendly    cse
4  harshitha     9     happy    cse